## Importing the libraries

In [3]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

## Importing the dataset

In [4]:
df = pd.read_csv("03. online.csv")
df.head(10)

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94
5        131876.90        99814.71  362861.36    Dhaka  156991.12
6        134615.46       147198.87  127716.82      Ctg  156122.51
7        130298.13       145530.06  323876.68  Rangpur  155752.60
8        120542.52       148718.95  311613.29    Dhaka  152211.77
9        123334.88       108679.17  304981.62      Ctg  149759.96

In [5]:
df.isnull().sum()

Marketing Spend    0
Administration     0
Transport          0
Area               0
Profit             0
dtype: int64

## if missiong (suppose administration)
## missing = df.Administration.mean()
## df.Administration = df.Administration.fillna(missing)

In [6]:
x = df.drop(['Profit'], axis=1)
x.head(10)

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur
5        131876.90        99814.71  362861.36    Dhaka
6        134615.46       147198.87  127716.82      Ctg
7        130298.13       145530.06  323876.68  Rangpur
8        120542.52       148718.95  311613.29    Dhaka
9        123334.88       108679.17  304981.62      Ctg

In [7]:
y = df.iloc[:,4:]
y.head(10)

      Profit
0  192261.83
1  191792.06
2  191050.39
3  182901.99
4  166187.94
5  156991.12
6  156122.51
7  155752.60
8  152211.77
9  149759.96

## Convert the column into categorical columns

In [8]:
city = pd.get_dummies(x['Area'], drop_first=True)
city.head(10)

   Dhaka  Rangpur
0      1        0
1      0        0
2      0        1
3      1        0
4      0        1
5      1        0
6      0        0
7      0        1
8      1        0
9      0        0

## Drop the Area coulmn

In [9]:
x = x.drop('Area',axis=1)
x.head(10)

   Marketing Spend  Administration  Transport
0        114523.61       136897.80  471784.10
1        162597.70       151377.59  443898.53
2        153441.51       101145.55  407934.54
3        144372.41       118671.85  383199.62
4        142107.34        91391.77  366168.42
5        131876.90        99814.71  362861.36
6        134615.46       147198.87  127716.82
7        130298.13       145530.06  323876.68
8        120542.52       148718.95  311613.29
9        123334.88       108679.17  304981.62

## concatation

In [10]:
x = pd.concat([x,city], axis=1)
x.head(10)

   Marketing Spend  Administration  Transport  Dhaka  Rangpur
0        114523.61       136897.80  471784.10      1        0
1        162597.70       151377.59  443898.53      0        0
2        153441.51       101145.55  407934.54      0        1
3        144372.41       118671.85  383199.62      1        0
4        142107.34        91391.77  366168.42      0        1
5        131876.90        99814.71  362861.36      1        0
6        134615.46       147198.87  127716.82      0        0
7        130298.13       145530.06  323876.68      0        1
8        120542.52       148718.95  311613.29      1        0
9        123334.88       108679.17  304981.62      0        0

## Splitting the dataset into the Training set and Test set

In [11]:
from sklearn.model_selection import train_test_split

In [12]:
xtrain, xtest, ytrain, ytest = train_test_split(x,y, test_size=0.25, random_state=True)

## Fitting Multiple Linear Regression to the Training set

In [13]:
from sklearn.linear_model import LinearRegression
regressor = LinearRegression()

In [14]:
regressor.fit(xtrain, ytrain)

LinearRegression()

## Predicting the Test set results

In [16]:
pred = regressor.predict(xtest)
pred

array([[128970.94931164],
       [ 94828.31285859],
       [ 81731.56746651],
       [ 75895.19562524],
       [176099.90741867],
       [173273.75118269],
       [ 44515.20084462],
       [103041.30105485],
       [ 77625.00002628],
       [ 98509.81855802],
       [ 90346.91052112],
       [ 84224.18281902],
       [129815.7234491 ]])

In [17]:
regressor.score(xtest,ytest)

0.9047265530273864

## r2 value (r squared)

In [18]:
from sklearn.metrics import r2_score

In [19]:
score = r2_score(ytest, pred)
score

0.9047265530273864